10852355035748711536619/bayes-theorem.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-20 Sat 12:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bayes&rsquo; Theorem</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Rick Neff" />
</head>
<body>
<div id="content">
<h1 class="title">Bayes&rsquo; Theorem</h1>

<div id="outline-container-orgdde570c" class="outline-2">
<h2 id="orgdde570c">Introduction</h2>
<div class="outline-text-2" id="text-orgdde570c">
<p>
If you read the guide at <a href="https://arbital.com/p/bayes_rule/?l=1zq">Arbital.com</a> you will get at least a glimmer of an
understanding that the key concept behind this mysterious thing called Bayes&rsquo;
Theorem (also called Bayes&rsquo; Rule) is that extra information allows one to
derive a more realistic estimate of the probability that a particular event
occurs.
</p>
</div>

<div id="outline-container-orge391965" class="outline-3">
<h3 id="orge391965">The Theorem</h3>
<div class="outline-text-3" id="text-orge391965">
<p>
If \(A\) and \(B\) are events such that \(p(A) \ne 0\) and \(p(B) \ne 0\),
then
</p>

<p>
\(p(A\ |\ B) = \frac{p(B\ |\ A)p(A)}{p(B\ |\ A)p(A) + p(B\ |\
   \overline{A})p(\overline{A})}\).
</p>
</div>
</div>

<div id="outline-container-orgf9d7569" class="outline-3">
<h3 id="orgf9d7569">The Proof</h3>
<div class="outline-text-3" id="text-orgf9d7569">
<p>
Bayes&rsquo; Theorem is just an equation &#x2014; it expresses the equivalence between
something on the left-hand-side of the equals sign (LHS) and something else
on the right-hand-side (RHS).
</p>

<p>
Like most proofs of equations, this one is a straightforward application of
definitions, first principles (axioms) such as <i>quantities equal to the same
thing are equal to each other</i> and identities such as De Morgan&rsquo;s laws or the
distributive laws (for sets).
</p>

<p>
From the definition of events and sample spaces we have \(B = B \cap
   S\).
</p>

<p>
From the law of set complementarity we have \(S = A \cup
   \overline{A}\).
</p>

<p>
Therefore, \(p(B) = p(B \cap S) = p(B \cap (A \cup \overline{A})) =
   p((B \cap A) \cup (B \cap \overline{A}))\) (by the
distributive law) \(= p(B \cap A) + p(B \cap \overline{A}) - p(A
   \cap \overline{A})\) (by the definition of probability of the
union of two events) \(= p(B \cap A) + p(B \cap \overline{A}) - 0\)
(by substituting equals for equals) \(= p(B \cap A) + p(B
   \cap \overline{A})\).
</p>

<p>
Now, from the definition of conditional probability (the
probability that \(B\) will happen after it is known that \(A\)
happened) we have \(p(B\ |\ A) = p(B \cap A)\ /\ p(A)\).
</p>

<p>
From that, and because \(p(B \cap A) = p(A \cap B)\) (set
intersection is commutative), we have
</p>

<p>
\(p(B\ |\ A)p(A) = p(B \cap A) = p(A \cap B) = p(A\ |\ B)p(B),\
   \text{ or }\ p(A\ |\ B) =\)
</p>

<p>
\(\frac{p(B\ |\ A)p(A)}{p(B)} = \frac{p(B\ |\ A)p(A)}{p(B \cap A) +
   p(B \cap \overline{A})} = \frac{p(B\ |\ A)p(A)}{p(B\ |\ A)p(A) +
   p(B\ |\ \overline{A})p(\overline{A})}\).
</p>

<p>
by dividing through by \(p(B)\), substituting what we saw \(p(B)\)
equals in the paragraph above that begins with the word
<i>Therefore</i>, and again using the definition of conditional
probability in the two terms of the denominator of the fraction to
substitute equals for equals.
</p>

<p>
Q.E.D.
</p>
</div>
</div>
</div>

<div id="outline-container-orgcc68bee" class="outline-2">
<h2 id="orgcc68bee">Example</h2>
<div class="outline-text-2" id="text-orgcc68bee">
<p>
What is the probability that a random person who <i>tests positive</i> for a
disease <i>actually has</i> the disease, if we know that 1% of the population has
the disease, that 95% of those who have the disease test positive for it, and
2% of those who do not have the disease test positive for it?
</p>

<p>
Let \(H =\) a person Has the disease.
</p>

<p>
Let \(T =\) a person Tests positive for the disease.
</p>

<p>
We're given:
</p>

<ul class="org-ul">
<li>\(p(H) = 0.01\)</li>
<li>\(p(T \mid H) = 0.95\)</li>
<li>\(p(T \mid \overline{H}) = 0.02\)</li>
</ul>

<p>
We want \(p(H \mid T)\). Try it yourself, the answer is given below.
</p>
</div>
</div>

<div id="outline-container-orgc989396" class="outline-2">
<h2 id="orgc989396">Three Out of Four</h2>
<div class="outline-text-2" id="text-orgc989396">
<p>
The relationship between the four probabilities is good to know, because we
often have good probability estimates for three of the numbers, but we need to
compute the fourth.
</p>

<p>
For another example, suppose a doctor
</p>

<ul class="org-ul">
<li>knows that the disease meningitis gives a sufferer a stiff neck 70% of the
time.</li>
<li>knows some unconditional facts about meningitis and stiff necks, i.e.,
<ul class="org-ul">
<li>the prior probability of someone having meningitis is low, only .002% (1
out of 50,000 people);</li>
<li>the prior probability of someone having a stiff neck is 1%.</li>
</ul></li>
</ul>

<p>
Let S = has a stiff neck, M = has meningitis.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">p(S | M)</td>
<td class="org-left">=</td>
<td class="org-right">0.7</td>
</tr>

<tr>
<td class="org-left">p(M)</td>
<td class="org-left">=</td>
<td class="org-right">.00002</td>
</tr>

<tr>
<td class="org-left">p(S)</td>
<td class="org-left">=</td>
<td class="org-right">.01</td>
</tr>

<tr>
<td class="org-left">p(M | S)</td>
<td class="org-left">=</td>
<td class="org-right">p(S | M)p(M) / p(S) = (0.7)(.00002) / 0.01 = 0.0014</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org585a6b4" class="outline-2">
<h2 id="org585a6b4">Lowered Expectations</h2>
<div class="outline-text-2" id="text-org585a6b4">
<p>
So the doctor should expect fewer than 1 in 700 patients with a stiff
neck to have meningitis.
</p>

<p>
Note that even though meningitis strongly indicates a stiff neck
(with probability 0.7), the probability of meningitis stays small,
because the prior probability of stiff necks is so much higher than
that of meningitis.
</p>

<p>
The general idea is that we would like to determine, from our seeing
as evidence the <i>effect</i> of some unknown <i>cause</i>, what that <i>cause</i>
is.
</p>
</div>
</div>

<div id="outline-container-org2b11de4" class="outline-2">
<h2 id="org2b11de4">Cause and Effect</h2>
<div class="outline-text-2" id="text-org2b11de4">
<p>
In this context Bayes' Theorem says
</p>

<p>
p(cause | effect) = p(effect | cause) &sdot; p(cause) / p(effect)
</p>

<p>
Equivalently,
</p>

<p>
p(effect | cause) = p(cause | effect) &sdot; p(effect) / p(cause)
</p>

<p>
There are two directions here, <i>causal</i> and <i>diagnostic</i>:
</p>

<ul class="org-ul">
<li>The <i>causal</i> direction finds p(effect | cause).</li>
<li>The <i>diagnostic</i> direction finds p(cause | effect).</li>
</ul>

<p>
In medical diagnosis, estimates of the conditional probabilities on causal
relationships are often what a doctor has (i.e., p(symptoms | disease)), and
what the doctor needs is to derive a diagnosis (i.e., p(disease | symptoms)).
</p>

<p>
In a more general setting, <b>Truth</b> is to <b>cause</b> as <b>Test</b> is to <b>effect</b>.
</p>
</div>
</div>

<div id="outline-container-org50699b0" class="outline-2">
<h2 id="org50699b0">Truth versus Test</h2>
<div class="outline-text-2" id="text-org50699b0">
</div>
<div id="outline-container-org70033ae" class="outline-3">
<h3 id="org70033ae">Problem</h3>
<div class="outline-text-3" id="text-org70033ae">
<p>
What is the probability that a random person who tests positive for
a certain disease actually has the disease, if we know that 1% of
the population has the disease, that 95% of those who have the
disease test positive for it, and 2% of those who do not have the
disease test positive for it?
</p>
</div>
</div>

<div id="outline-container-org621ef52" class="outline-3">
<h3 id="org621ef52">Solution</h3>
<div class="outline-text-3" id="text-org621ef52">
<p>
Let \(H\) be the event that a person has the disease.
</p>

<p>
Let \(T\) be the event that the person tests positive for it.
</p>

<p>
The problem statement gives \(p(T\ |\ H), p(T\ |\ \overline{H})\) and
\(p(H)\).
</p>

<p>
We know that \(p(T) = p(T\ |\ H) \cdot p(H) + p(T\ |\ \overline{H})
  \cdot p(\overline{H})\) (question: how do we know that?)
</p>

<p>
What is asked for is \(p(H\ |\ T)\), which we can find using the
identity:
</p>

<p>
\(p(H\ |\ T) = p(T\ |\ H) p(H) / p(T)\).
</p>

<p>
\(p(H) = 0.01\)
</p>

<p>
\(p(\overline{H}) = 1 - p(H) = 1 - 0.01 = .99\)
</p>

<p>
\(p(T\ |\ H) = 0.95\)
</p>

<p>
\(p(T\ |\ \overline{H}) = 0.02\)
</p>

<p>
\(\therefore\)
</p>

<p>
\(p(T) = (.95)(.01) + (.02)(.99) = .0095 + .0198 = .0293\)
</p>

<p>
\(p(H\ |\ T) = (.95)(.01)/(.0293) = .0095/.0293 = .324 \approx 32\%\)
</p>
</div>
</div>
</div>

<div id="outline-container-org11d9bdf" class="outline-2">
<h2 id="org11d9bdf">Visualize</h2>
<div class="outline-text-2" id="text-org11d9bdf">
<p>
It helps to visualize the four disjoint event subsets with their
probabilities in table form:
</p>

<p>
\(\begin{array}{|r|r|r|r|}
  \hline
  & & & \\
  & p(\overline{H}) & p(H) & \\
  \hline
  & & & \\
  p(T) & p(\overline{H} \cap T) = .0198 & p(H \cap T) = .0095 & .0293 \\
  & & & \\
  & = p(\overline{H}\ |\ T) \cdot p(T) & = p(H\ |\ T) \cdot p(T) & \\
  & = p(T\ |\ \overline{H}) \cdot p(\overline{H}) & = p(T\ |\ H) \cdot p(H) & \\
  & & & \\
  \hline
  & & & \\
  p(\overline{T}) & p(\overline{H} \cap \overline{T}) = .9702 & p(H \cap \overline{T}) = .0005 & .9707 \\
  & & & \\
  & = p(\overline{H}\ |\ \overline{T}) \cdot p(\overline{T}) & = p(H\ |\ \overline{T}) \cdot p(\overline{T}) & \\
  & = p(\overline{T}\ |\ \overline{H}) \cdot p(\overline{H}) & = p(\overline{T}\ |\ H) \cdot p(H) & \\
  & & & \\
  \hline
  & & & \\
  & .9900 & .0100 & 1.0 \\
  \hline
  \end{array}\)
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Rick Neff</p>
<p class="date">Created: 2018-10-20 Sat 12:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
